This change is applied:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # github_team_repository.contributor_repos["artichoke"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "artichoke"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["boba"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "boba"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["cactusref"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "cactusref"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["clang-format"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "clang-format"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["focaccia"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "focaccia"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["intaglio"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "intaglio"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["jasper"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "jasper"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["playground"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "playground"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["qed"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "qed"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["rand_mt"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "rand_mt"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["raw-parts"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "raw-parts"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["roe"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "roe"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["ruby-file-expand-path"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "ruby-file-expand-path"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["strftime-ruby"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "strftime-ruby"
      + team_id    = (known after apply)
    }

  # github_team_repository.contributor_repos["strudel"] will be created
  + resource "github_team_repository" "contributor_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "strudel"
      + team_id    = (known after apply)
    }

  # module.org_members.github_membership.members["b-n"] will be created
  + resource "github_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "b-n"
    }

  # module.team_contributors.github_team.this will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Code contributors"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "contributors"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # module.team_contributors.github_team_members.this will be created
  + resource "github_team_members" "this" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "lopopolo"
        }
      + members {
          + role     = "member"
          + username = "b-n"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.org_members.github_membership.members["b-n"]: Creating...
module.team_contributors.github_team.this: Creating...
module.org_members.github_membership.members["b-n"]: Creation complete after 4s [id=artichoke:b-n]
module.team_contributors.github_team.this: Creation complete after 6s [id=6269781]
github_team_repository.contributor_repos["qed"]: Creating...
github_team_repository.contributor_repos["playground"]: Creating...
github_team_repository.contributor_repos["ruby-file-expand-path"]: Creating...
github_team_repository.contributor_repos["raw-parts"]: Creating...
github_team_repository.contributor_repos["jasper"]: Creating...
github_team_repository.contributor_repos["clang-format"]: Creating...
module.team_contributors.github_team_members.this: Creating...
github_team_repository.contributor_repos["strftime-ruby"]: Creating...
github_team_repository.contributor_repos["artichoke"]: Creating...
github_team_repository.contributor_repos["rand_mt"]: Creating...
github_team_repository.contributor_repos["playground"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["raw-parts"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["qed"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["ruby-file-expand-path"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["jasper"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["clang-format"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["strftime-ruby"]: Still creating... [10s elapsed]
module.team_contributors.github_team_members.this: Still creating... [10s elapsed]
github_team_repository.contributor_repos["artichoke"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["rand_mt"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["qed"]: Creation complete after 17s [id=6269781:qed]
github_team_repository.contributor_repos["strudel"]: Creating...
github_team_repository.contributor_repos["raw-parts"]: Creation complete after 17s [id=6269781:raw-parts]
github_team_repository.contributor_repos["intaglio"]: Creating...
github_team_repository.contributor_repos["jasper"]: Creation complete after 18s [id=6269781:jasper]
github_team_repository.contributor_repos["cactusref"]: Creating...
github_team_repository.contributor_repos["ruby-file-expand-path"]: Creation complete after 18s [id=6269781:ruby-file-expand-path]
github_team_repository.contributor_repos["focaccia"]: Creating...
github_team_repository.contributor_repos["playground"]: Creation complete after 18s [id=6269781:playground]
github_team_repository.contributor_repos["roe"]: Creating...
github_team_repository.contributor_repos["clang-format"]: Creation complete after 18s [id=6269781:clang-format]
github_team_repository.contributor_repos["boba"]: Creating...
github_team_repository.contributor_repos["strftime-ruby"]: Creation complete after 18s [id=6269781:strftime-ruby]
github_team_repository.contributor_repos["artichoke"]: Creation complete after 19s [id=6269781:artichoke]
github_team_repository.contributor_repos["rand_mt"]: Creation complete after 19s [id=6269781:rand_mt]
module.team_contributors.github_team_members.this: Creation complete after 20s [id=6269781]
github_team_repository.contributor_repos["strudel"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["intaglio"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["cactusref"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["focaccia"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["roe"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["boba"]: Still creating... [10s elapsed]
github_team_repository.contributor_repos["strudel"]: Creation complete after 11s [id=6269781:strudel]
github_team_repository.contributor_repos["intaglio"]: Creation complete after 12s [id=6269781:intaglio]
github_team_repository.contributor_repos["cactusref"]: Creation complete after 11s [id=6269781:cactusref]
github_team_repository.contributor_repos["focaccia"]: Creation complete after 11s [id=6269781:focaccia]
github_team_repository.contributor_repos["roe"]: Creation complete after 11s [id=6269781:roe]
github_team_repository.contributor_repos["boba"]: Creation complete after 11s [id=6269781:boba]

Apply complete! Resources: 18 added, 0 changed, 0 destroyed.
```